s0lness/tiny-computers/devices/rp2350-amoled-1.8/firmware/apps/menu.c
/*
 * menu: how a child picks an app.
 *
 * Landscape, full-screen. Icons only, in a row along the TOP of the screen -
 * no borders, no tile rectangles, no app name printed underneath. The owner's
 * words for this design: "je pense qu'on fait juste des icones... ne mets que
 * les icones, en haut de l'ecran, sans texte, sans bordure." Pictures only:
 * reading English is not the entry fee for a child who cannot yet, and now
 * neither is reading a frame around a picture.
 *
 * Touch is the ONLY input this file reads. Touching an icon launches that
 * app immediately - "je veux que ce soit que du touch. toucher une app ouvre
 * une app." There used to also be a button-driven cursor (BOOT moved a
 * selection, PWR-short launched it) for a device held sideways with both
 * thumbs on the buttons and no finger free for the glass. That path, and the
 * "which tile is selected" state it needed, are both gone: with touch as the
 * only way to launch, there is nothing left to select in advance and nothing
 * left to draw a cursor around. One less piece of state to get wrong is a
 * simplification, not a loss - see menu_state_t's comment.
 *
 * The touch TARGET is not the small icon itself: each icon's touch region is
 * a full-height column spanning the whole screen top to bottom, only its
 * WIDTH tied to the icon above it - see this file's comment on
 * column_hit_test() for the exact sizes and why.
 *
 * Opening and closing the menu (the BOOT+PWR long-press chord) is entirely
 * the runtime's business; this file never reads the PMIC and never calls
 * app_switch_to() with its own index. It only ever switches TO a real
 * g_apps[] entry, on a touch.
 */
#include <math.h>
#include <stdio.h>

#include <stdbool.h>

#include "app.h"
#include "gfx.h"
#include "sensors.h"
#include "menu.h"
#include "shapes.h"

// Named directly, the same trick runtime.c uses to single out the
// sketchpad: picking an icon for a tile has to know which app it is looking
// at, and app_t carries nothing more specific than a display name (which is
// free-form text the app itself chose, not a stable identifier this file
// should be parsing).
extern const app_t g_chronoApp;
extern const app_t g_sketchApp;
extern const app_t g_timerApp;
extern const app_t g_fourApp;

/* ---------------------------------------------------------------------
 * Layout, landscape coordinates (LAND_W x LAND_H = 448 x 368). Icons sit in
 * one row near the top; g_appCount is an extern int, not a macro (sized from
 * the linked app table, see app.h), so the split below is computed at
 * runtime rather than checked with a compile-time _Static_assert.
 * ------------------------------------------------------------------- */
#define ICON_TOP_MARGIN 24 // gap from the screen's top edge to the icon's own box

#define ICON_W 96
#define ICON_H 96

// Column i's horizontal span, in landscape x. Contiguous and full-width
// (no gap, no margin either side): the LAST column absorbs whatever LAND_W
// does not divide evenly, so every x in [0, LAND_W) belongs to exactly one
// column and none is dead space a touch can fall into and hit nothing.
static void column_rect_land(int i, int *bx, int *bw) {
    int n = g_appCount;
    int w = LAND_W / n;
    *bx = i * w;
    *bw = (i == n - 1) ? (LAND_W - *bx) : w;
}

// The touch coordinates a tick() sees arrive in PANEL (portrait) space, not
// landscape - see app.h's comment on touchX/touchY and gfx.h's note that it
// rotates rectangles, not pixels, so a landscape app that hit-tests a touch
// has to invert the mapping itself. gfx.h only documents the forward
// direction (landscape -> panel: px = PANEL_W-1-ly, py = lx, see gfx_land_
// rect's header comment) because chrono and timer, the other two landscape
// apps, never need the inverse: they draw digits, not touch targets. Solved
// here by algebra on that same documented mapping, not by a new gfx.h
// helper (nothing else needs it, same reasoning as this file's icon code
// below).
static void panel_to_land(int px, int py, int *lx, int *ly) {
    *lx = py;
    *ly = PANEL_W - 1 - px;
}

// THE TOUCH TARGET. Not the icon's own ~96px box - a full-height column,
// LAND_H (368px, the panel's entire landscape height) tall and one column
// width (LAND_W/g_appCount, 112px for today's 4 apps, 149px when there were
// three) wide. AGENTS.md's
// finger-size section measures a child's fingertip contact at ~75px on this
// panel; 112px is still comfortably over one finger-width across, and 368px is the
// WHOLE screen top to bottom - there is no way to miss vertically at all,
// which is the actual gain over the old ~220px-tall tile: a child aiming
// only roughly at an icon, anywhere in its column, still launches it. ly is
// computed by panel_to_land() above but genuinely unused here (see its
// caller): only which column lx falls in decides the hit.
static int column_hit_test(int lx) {
    int n = g_appCount;
    int w = LAND_W / n;
    int idx = lx / w;
    if (idx >= n) idx = n - 1; // clamp into the last column, which absorbed
                                // LAND_W's remainder in column_rect_land()
    if (idx < 0) idx = 0;
    return idx;
}

/* ---------------------------------------------------------------------
 * Icons: filled rectangles only, per this file's header comment. Each is
 * drawn into an ICON_W x ICON_H box at a given landscape origin.
 * ------------------------------------------------------------------- */

/* ---------------------------------------------------------------------
 * The chrono icon: THIRD PASS, 2026-08-14. The owner's verdict on round 2
 * (a plain annulus plus one crown flick, commit e8e1548 - the ring/wedge/
 * crown-rect/neck-rect/tab-diamond silhouette replaced rather than fixed):
 * "j'aimais bien celui qu'on avait avant" - he preferred the OLD icon,
 * still on the device at the time he judged this. The coordinator's read,
 * which holds up: the filled WEDGE is what said "a dial with something on
 * it"; a plain ring with a nub reads as a ring with a nub.
 *
 * So the old silhouette is back - ring, wedge, crown+neck, tab - but built
 * two ways round 1 never was:
 *
 *   - "des traits moins droits" (less straight lines): round 1's wedge had
 *     one dead-straight vertical edge, its crown+neck were two exact
 *     rectangles, and its tab was an exact diamond. All three are now
 *     HAND-WOBBLED constant tables instead - see tools/gen-chrono-icon.ts,
 *     which generates them from a seeded RNG smoothed through tldraw's own
 *     streamline pass (ingest(), tools/tldraw-freehand/core.ts - the
 *     vendored pipeline), the same technique gen-strokes.ts already uses
 *     to humanise Hershey letterforms. Baked as fixed constants rather
 *     than recomputed on device, the same call draw_icon_sketch's own
 *     fx/fy/fr waypoints already made: a wobble chosen once at design
 *     time, not a device-cycle expense.
 *   - "les pixels qui sortent" (the rule that also cost the hourglass its
 *     two floating grains): round 1's tab was held deliberately
 *     CHRONO_TAB_GAP px "clear of the ring" - it floated, touching
 *     nothing, on purpose. Rebuilt below as a short connected stroke
 *     chain whose BASE DISC is centred on the ring's own painted band
 *     (CHRONO_R_MID) - the exact join technique round 2's crown flick
 *     already proved (the base overlaps the ring's own solid ink before
 *     MIN composition ever has to decide anything, so there is no seam to
 *     trap), now used for both the crown and the tab.
 *
 * The ring itself is unchanged from round 2: shapes_fill_annulus_aa_land,
 * a true circle. It has no straight edge for "moins droits" to apply to
 * and it was never the part that floated.
 * ------------------------------------------------------------------- */
#define CHRONO_R_OUT       (ICON_W * 17 / 48)                    // 34
#define CHRONO_STROKE      10                                    // ring band width - "pretty thick"
#define CHRONO_R_IN        (CHRONO_R_OUT - CHRONO_STROKE)        // 24
#define CHRONO_R_MID       ((CHRONO_R_OUT + CHRONO_R_IN) / 2)    // 29, the ring's own centreline
#define CHRONO_CROWN_LEN   14                                    // crown path's own extent, see s_chronoCrownDy

