s0lness/tiny-computers/devices/rp2350-amoled-1.8/firmware/apps/menu.c
    // Midpoints between consecutive waypoints: the curve's actual segment
    // endpoints (see the header comment above and shapes.c's comment on
    // shapes_fill_tapered_quad_land). Radius at a midpoint is the average
    // of its two waypoints' radii, matching sketch.c's own ar/dr in
    // draw_quad_midpoint.
    int mx01 = (px[0] + px[1]) / 2, my01 = (py[0] + py[1]) / 2, mr01 = (pr[0] + pr[1]) / 2;
    int mx12 = (px[1] + px[2]) / 2, my12 = (py[1] + py[2]) / 2, mr12 = (pr[1] + pr[2]) / 2;
    int mx23 = (px[2] + px[3]) / 2, my23 = (py[2] + py[3]) / 2, mr23 = (pr[2] + pr[3]) / 2;
    int mx34 = (px[3] + px[4]) / 2, my34 = (py[3] + py[4]) / 2, mr34 = (pr[3] + pr[4]) / 2;

    shapes_fill_capsule_aa_land((float)px[0], (float)py[0], (float)pr[0],
                                 (float)mx01, (float)my01, (float)mr01, color);
    shapes_fill_tapered_quad_aa_land((float)mx01, (float)my01, (float)mr01,
                                      (float)px[1], (float)py[1],
                                      (float)mx12, (float)my12, (float)mr12, color);
    shapes_fill_tapered_quad_aa_land((float)mx12, (float)my12, (float)mr12,
                                      (float)px[2], (float)py[2],
                                      (float)mx23, (float)my23, (float)mr23, color);
    shapes_fill_tapered_quad_aa_land((float)mx23, (float)my23, (float)mr23,
                                      (float)px[3], (float)py[3],
                                      (float)mx34, (float)my34, (float)mr34, color);
    shapes_fill_capsule_aa_land((float)mx34, (float)my34, (float)mr34,
                                 (float)px[4], (float)py[4], (float)pr[4], color);
}

/* ---------------------------------------------------------------------
 * The TIMER icon: an hourglass. Sand in the TOP bulb only, the bottom
 * empty - that asymmetry is the whole point (time still to come).
 *
 * WEIGHT DISTRIBUTION - read this before touching fill vs outline here
 * again. An earlier anti-aliased pass filled the WHOLE top chamber solid
 * and left the bottom as an outline, on a literal reading of the owner's
 * "que des aplats de couleur... comme si tout etait fait avec de l'encre"
 * (only flat areas of colour, as if everything were made with ink) as "no
 * outlines, only fills". Rendered, it read as an egg cup or a goblet: a
 * heavy dome sitting on a wire dome, not an hourglass, because a filled
 * bulb reads as the OBJECT rather than as glass with something inside it.
 * The correction: an anti-aliased stroke is ALSO an aplat - a solid band
 * of ink with a clean, soft edge, same as a filled region, just narrower.
 * What the owner was rejecting was the jagged PIXEL STAIRCASE the old
 * rectangle-bar renderer produced on every curve and diagonal (shapes.h's
 * whole second generation exists to fix exactly that), not the concept of
 * an outline. Do not re-fill the bulbs on the strength of that quote alone
 * - the fix for "petits pixels nuls" was anti-aliasing, already done; this
 * paragraph is the record of that being re-litigated once already.
 *
 * So: BOTH bulbs are glass, drawn identically (same stroke weight, mirror
 * images about the waist - see MIRROR SYMMETRY below, unchanged). The SAND
 * is a separate, solid shape sitting INSIDE the top bulb's glass, in its
 * lower portion only (see "THE SAND" below) - thin glass holding a heavy,
 * solid mass is what actually reads as an hourglass: you can see the sand
 * sitting in the glass, rather than the sand and the glass being the same
 * material.
 *
 * MIRROR SYMMETRY ABOUT THE WAIST - two ROUND, near-spherical bulbs, not
 * hard-edged triangles (a schematic symbol, not an object); unchanged from
 * the original owner correction ("l'icone de sablier est ultra moche. elle
 * devrait etre plus ronde") against a reference photo of a real hourglass.
 * This is what makes an hourglass legible at a glance: the top chamber is
 * widest at its cap and narrows going down to
 * the waist; the bottom chamber must be the exact opposite - narrowest at
 * the waist, widening going down to its own cap. s_timerBulbHw[] below is
 * filled ONCE for that shape (row 0 = cap/wide, last row = waist/narrow)
 * and the bottom chamber's drawing loop reads it BACKWARDS (index
 * TIMER_CHAMBER_H-1-row), so row 0 of the bottom chamber (right under the
 * waist) reads the table's LAST entry (narrow) and its last row (the
 * bottom cap) reads the table's FIRST entry (wide) - see the bottom loop
 * below. Verified by measuring the actual rendered framebuffer, not just
 * by eye: half-width at the bottom chamber's own rows is strictly
 * increasing from the waist down to the cap, never the other way - this
 * was got wrong once during development (mirrored correctly on paper, but
 * the first rendered version still read as a funnel - see the next
 * paragraph for why that was a curve-SHAPE bug, not a mirroring one) and
 * is worth re-checking this way, not by eye, if this shape is ever
 * retuned again.
 *
 * A FIRST version of this curve (a single circle, one radius sampled off
 * its own lower arc - see this file's git history) got the mirroring
 * above right but still read as a funnel, not a bulb, for a reason that
 * has nothing to do with which end is wide: a circle is locally FLAT right
 * at its own peak and increasingly STEEP away from it, and forcing the
 * peak to sit exactly at row 0 (the only way a single circle can reach a
 * chamber this tall - see below) put all of that flatness at the wide end
 * and all of the steepness at the narrow end. Flat-then-steep is exactly
 * the silhouette of a funnel or a martini glass, not a sphere, regardless
 * of which end is which - a ball's curvature is closer to symmetric on
 * both sides of its widest point. Confirmed both by eye against the
 * reference photo and numerically: a circle's own half-width formula is
 * hw(row) = sqrt(R^2 - dy^2), whose slope near dy=0 (the peak) is
 * approximately -dy/R - near zero when dy is small relative to R, which it
 * necessarily is when R has to be almost as large as TIMER_HALF_OUT itself
 * just to reach TIMER_HALF_NECK within the chamber's own height (see next
 * paragraph) - so "near the peak" ends up covering most of the visible cap.
 *
 * Why the peak cannot just be moved inside the window: reaching from a
 * half-width of TIMER_HALF_OUT down to TIMER_HALF_NECK on a circle of
 * radius R takes very close to R rows of descent (exactly sqrt(R^2 -
 * TIMER_HALF_NECK^2), which is within a few percent of R whenever
 * TIMER_HALF_NECK is small next to R, as it is here). At the dimensions
 * this was first found against (a 34-row chamber, TIMER_HALF_OUT=40) that
 * was roughly 39-40 rows on its own - already more than the chamber's own
 * height, with nothing left over to also spend rows on a rounded shoulder
 * above the peak. Tried numerically before settling on the fix below:
 * moving the peak 10 rows inside that window while still hitting both
 * endpoints exactly forced a radius wider than TIMER_HALF_OUT by under
 * half a pixel - an invisible bulge bought at a real cost in code
 * complexity, for nothing. Growing the chamber a little (roughly +20%) was
 * the other lever tried at the time, and was rejected too, for spending
 * its rows on a still sub-pixel bulge rather than on anything the icon
 * keeps - the chamber eventually DID grow, but for a different reason (see
 * "PROPORTIONS" below), and by enough (34 -> 44 rows, nearly +30%) that
 * the bulge this same algebra produces is no longer sub-pixel: worth
 * knowing if the exact numbers here ever get re-tuned again, since the
 * tradeoff that ruled this lever out originally no longer holds.
 *
 * The fix: an ELLIPSE, not a circle. A circle has exactly one radius,
 * which fixes its width AND how many rows it takes to reach any given
 * narrower width TOGETHER - that coupling is the actual problem above, not
 * the chamber height. An ellipse has two independent axes, so the bulge's
 * PEAK WIDTH and how far it takes to fall from the peak to each endpoint
 * can be solved separately. hw(row) = A*sqrt(1 - ((row-P)/B)^2), with the
 * peak position P chosen directly (TIMER_BULB_PEAK_ROW, about 3/10 of the
 * way down - close to where the reference photo's own widest point sits)
 * and (A, B) solved from the two endpoints this shape must still hit
 * exactly (hw(0) = TIMER_HALF_OUT, hw(TIMER_CHAMBER_H-1) =
 * TIMER_HALF_NECK) - see ensure_timer_bulb_table() for the two-line
 * derivation. The overshoot past TIMER_HALF_OUT this buys is real and
 * visible, not the sub-pixel one a circle was stuck with, and the curve is
 * close to symmetric in shape on both sides of that peak the way a ball's
 * is.
 *
 * PROPORTIONS: an hourglass is TALL and NARROW - being that shape is as
 * much a part of reading as "hourglass" as the waist is, and an early pass
 * at this icon (TIMER_MARGIN=12, TIMER_HALF_OUT=40, TIMER_CHAMBER_H=34)
 * measured out at roughly 90px wide by 70px tall on the rendered
 * framebuffer, wider than it was tall - two stacked bowls, not an
 * hourglass. Fixed by pulling both available levers at once rather than
 * either alone: TIMER_MARGIN dropped close to 0 so the whole ICON_H is
 * spent on the glass instead of a lot of it sitting in unused top/bottom
 * padding, and TIMER_HALF_OUT/TIMER_HALF_NECK both came down so the
 * chambers are slimmer. Measured on the current numbers below: ink height
 * (top cap to bottom cap) 92px, ink width (at the widest bulge) about
 * 66px - a 0.72 width/height ratio, against the reference photo's own
 * "distinctly taller than wide" and the brief's 0.7 target.
 *
 * REDRAWN 2026-08-14, ink-strokes pass. The owner's rule this pass named
 * this icon specifically: "the hourglass must have no loose grain of
 * sand." The two individual falling-grain discs that used to sit just
 * below the neck are deleted (see that call site's own comment) - they
 * floated, touching nothing, which is exactly what the rule forbids; the
 * heap resting on the bottom cap already carries "sand has landed"
 * without a mark that has to float to say it. TIMER_OUTLINE also went
 * from 4px to 6px, for the "pretty thick, confident, Ink and Switch"
 * weight the other two icons now carry - kept short of THEIR stroke
 * width on purpose, since this icon's own argument above is that thin
 * glass around a solid sand mass is what reads as an hourglass rather
 * than an egg cup; matching the other icons' full boldness here would
 * refight that argument.
 *
 * The owner has never liked this object ("l'icone de sablier est ultra
 * moche") and this pass asked, on top of the pixel-level fix, whether an
 * hourglass is even the right choice any more - the timer app itself
 * stopped showing one when it became a coil dial (docs/decisions/
 * 0002-runtime-architecture.md, "the coil"). draw_icon_timer_coil()
 * below is the proposed alternative: same "one continuous piece of ink"
 * rule, a different object. Both are wired to compile; TIMER_ICON_USE_COIL
 * (see draw_icon_for) picks which one actually paints. See this icon's
 * task report for a rendered side-by-side and which the agent preferred.
 * ------------------------------------------------------------------- */
#define TIMER_MARGIN    (ICON_H / 48)                             // 2
#define TIMER_HALF_OUT  (ICON_W * 7 / 24)                          // 28
#define TIMER_HALF_NECK 5
#define TIMER_NECK_H    (ICON_H / 24)                              // 4
#define TIMER_CHAMBER_H ((ICON_H - 2 * TIMER_MARGIN - TIMER_NECK_H) / 2) // 44
#define TIMER_OUTLINE   (ICON_W / 16)                              // 6, bumped from 4 2026-08-14 for
                                                                     // the "pretty thick, confident"
                                                                     // ink-strokes pass - see this
                                                                     // block's header comment.

// Where the bulb's TRUE widest point sits, measured down from the cap -
// see this block's header comment for why this needs to be a free choice
// (an ellipse, not a circle) rather than something solved for. 3/10 of the
// way down is close to where the reference photo's own bulge sits; 13 rows
// at today's (taller) chamber.
#define TIMER_BULB_PEAK_ROW (TIMER_CHAMBER_H * 3 / 10)

