s0lness/tiny-computers/devices/rp2350-amoled-1.8/firmware/apps/menu.c
// ---- chrono candidate: timer.svg (Lucide), sole candidate. alarm-clock.svg
// and watch.svg were also fetched and considered - rejected because both
// carry a specific OTHER object's silhouette (an alarm clock's bell-ear
// legs, a wristwatch's strap lugs) that says something this device's
// stopwatch does not do (ring an alarm, strap to a wrist); clock.svg was
// rejected for the opposite reason, too generic (a bare clock face reads
// as "tells the time", not "counts elapsed time"). timer.svg's own dial +
// crown + hand is the closest thing Lucide has to a stopwatch pictogram.
static const float s_lucideChronoRingCx = 48.00f, s_lucideChronoRingCy = 56.00f, s_lucideChronoRingR = 32.00f;
static const float s_lucideChronoCrownX[2] = { 40.00f, 56.00f };
static const float s_lucideChronoCrownY[2] = { 8.00f, 8.00f };
static const float s_lucideChronoHandX[2] = { 48.00f, 60.00f };
static const float s_lucideChronoHandY[2] = { 56.00f, 44.00f };

static void draw_icon_lucide_chrono(int ox, int oy, uint16_t color) {
    float dx = (float)ox, dy = (float)oy;
    shapes_fill_annulus_aa_land(dx + s_lucideChronoRingCx, dy + s_lucideChronoRingCy,
                                 s_lucideChronoRingR + LUCIDE_STROKE_HALF, s_lucideChronoRingR - LUCIDE_STROKE_HALF, color);
    float cx[2] = { dx + s_lucideChronoCrownX[0], dx + s_lucideChronoCrownX[1] };
    float cy[2] = { dy + s_lucideChronoCrownY[0], dy + s_lucideChronoCrownY[1] };
    shapes_stroke_polyline_aa_land(cx, cy, 2, LUCIDE_STROKE_HALF, color);
    float hx[2] = { dx + s_lucideChronoHandX[0], dx + s_lucideChronoHandX[1] };
    float hy[2] = { dy + s_lucideChronoHandY[0], dy + s_lucideChronoHandY[1] };
    shapes_stroke_polyline_aa_land(hx, hy, 2, LUCIDE_STROKE_HALF, color);

    // TWO STEMS, ours and not Lucide's. Lucide's timer glyph leaves the top
    // bar floating clear of the circle, and the conversion was faithful to
    // that. The owner drew the two missing lines straight onto the render:
    // "assure toi que le haut du chronometre est bien relie au reste de
    // l'appareil comme je l'ai decide".
    //
    // He is holding an addition to his own standing rule, stated on the very
    // first icon round and never withdrawn since: one connected piece of ink,
    // nothing floating. A detached bar is the same defect as the hourglass's
    // loose grain of sand and the old chrono's floating tab, and it does not
    // stop being one because an upstream icon set drew it that way.
    //
    // Deliberately thinner than LUCIDE_STROKE_HALF: these are the crown's
    // stem, not another bar. They run from inside the bar's own ink down past
    // the ring's outer edge, so both joins overlap rather than abut, which is
    // what MIN composition needs to merge them into one mark.
    // ONE neck, not two stems. The first version used two, which left a
    // two-pixel window of paper between them: at 96px that reads as a hole
    // punched in the crown rather than as a neck, and the pair also piled ink
    // up where both met the ring, making that junction visibly heavier than
    // any other stroke in the set. The owner saw it as the icon spilling out
    // of itself ("ca deborde un tout petit peu sur le chronometre").
    //
    // A single centred neck has neither problem: no gap to misread, and one
    // junction instead of two. It also matches what a stopwatch actually
    // looks like, a wide button on a narrow stem.
    //
    // It runs from inside the bar's own ink down past the ring's outer edge,
    // so both joins overlap rather than abut, which is what MIN composition
    // needs to merge them into one mark.
    //
    // WHERE IT ENDS, and this is the whole of it: a round cap extends a full
    // radius past the point you give it. The first version ended at y=27 with
    // a 4px radius, so its ink actually reached y=31, while the ring's INNER
    // edge is at y=29 (centre 56, radius 32, half-stroke 5). Two pixels of
    // the neck therefore hung inside the dial, which is what the owner saw:
    // "y a des bouts qui descendent trop bas a l'interieur de la bordure".
    //
    // Ending at 24 puts the cap's far edge at 28, inside the ring's band
    // (19 to 29) rather than through it. Still overlapping, so the join
    // holds, without a millimetre in the white.
    {
        const float neckHalf = 4.0f;
        const float neckEndY = 24.0f;  // + neckHalf = 28, and the band ends at 29
        float sx[2] = { dx + 48.0f, dx + 48.0f };
        float sy[2] = { dy + 10.0f, dy + neckEndY };
        shapes_stroke_polyline_aa_land(sx, sy, 2, neckHalf, color);
    }
}

// ---- sketch candidates: pencil.svg and pencil-line.svg. pen-tool.svg
// (a vector-editor bezier-pen glyph) and brush.svg/paintbrush.svg (both
// say "colour", which this monochrome ink display never has) were
// rejected as the wrong tool's icon, not a style variant of the right
// one. Two are rendered because they are genuinely close: pencil-line
// adds a short mark under the pencil's own tip, which argues for itself
// on THIS app specifically (it draws, so a mark it already made is a
// fair thing to show) but costs a little of the plain pencil's own
// quiet minimalism ("invisible" per the owner's own goal for this set).
static const float s_lucidePencilBodyX[69] = { 84.70f, 86.10f, 87.14f, 87.78f, 88.00f, 87.78f, 87.14f, 86.10f, 84.70f, 82.99f, 81.04f, 78.93f, 76.73f, 74.53f, 72.41f, 70.46f, 68.75f, 15.37f, 15.20f, 15.03f, 14.87f, 14.72f, 14.57f, 14.43f, 14.29f, 14.16f, 14.04f, 13.92f, 13.81f, 13.71f, 13.62f, 13.53f, 13.44f, 13.37f, 8.08f, 8.02f, 8.00f, 8.01f, 8.06f, 8.14f, 8.26f, 8.41f, 8.59f, 8.79f, 9.01f, 9.26f, 9.51f, 9.78f, 10.05f, 10.31f, 10.58f, 27.99f, 28.22f, 28.45f, 28.68f, 28.90f, 29.12f, 29.34f, 29.56f, 29.77f, 29.98f, 30.18f, 30.38f, 30.58f, 30.77f, 30.95f, 31.13f, 31.31f, 84.70f };
static const float s_lucidePencilBodyY[69] = { 27.25f, 25.54f, 23.59f, 21.48f, 19.28f, 17.08f, 14.96f, 13.01f, 11.30f, 9.90f, 8.86f, 8.22f, 8.00f, 8.21f, 8.86f, 9.90f, 11.30f, 64.70f, 64.87f, 65.05f, 65.24f, 65.43f, 65.62f, 65.82f, 66.03f, 66.23f, 66.44f, 66.66f, 66.88f, 67.10f, 67.33f, 67.55f, 67.78f, 68.02f, 85.42f, 85.69f, 85.95f, 86.22f, 86.49f, 86.74f, 86.99f, 87.21f, 87.41f, 87.59f, 87.74f, 87.85f, 87.94f, 87.98f, 88.00f, 87.97f, 87.91f, 82.63f, 82.56f, 82.48f, 82.39f, 82.29f, 82.19f, 82.08f, 81.96f, 81.84f, 81.71f, 81.58f, 81.44f, 81.29f, 81.14f, 80.98f, 80.81f, 80.64f, 27.25f };
static const float s_lucidePencilTickX[2] = { 60.00f, 76.00f };
static const float s_lucidePencilTickY[2] = { 20.00f, 36.00f };

