s0lness/tiny-computers/devices/rp2350-amoled-1.8/firmware/apps/menu.c
/* ---------------------------------------------------------------------
 * THE GESTURE: press, drag, release.
 *
 * It used to launch on the first tick a touch was seen. The owner wants the
 * same idiom the rest of the device uses instead - the sketchpad's palette
 * and Connect Four both work this way: put a thumb down, slide until the
 * thing you want is lit, let go. Three reasons it is worth the extra code,
 * in order of how much they matter:
 *
 *   - A TAP CANNOT BE TAKEN BACK. Launching on touch-down means a child who
 *     puts a thumb down to look is already inside an app, and the only way
 *     out is a two-button chord she has to be taught. Release-to-launch
 *     gives her the whole gesture to change her mind in.
 *   - ONE IDIOM, LEARNED ONCE. Press-slide-release now opens a colour, drops
 *     a piece, and picks an app. Nothing on this device asks for anything
 *     different.
 *   - IT MAKES THE TARGET VISIBLE. Under a tap there is no moment at which
 *     the device can say which app you are about to get: by the time it
 *     knows, it has already switched. Under a drag there is a whole
 *     gesture's worth of it, which is what the halo below is for.
 *
 * CANCELLING is the point of the change, so it gets a real region rather
 * than a corner: everything below MENU_LAUNCH_BAND_H is dead space where
 * nothing is lit and a release does nothing. The icons sit at y 24-120 and
 * the band runs to 220, so a hundred pixels of slack below them still
 * launch and you have to drag deliberately downward to cancel. Dragging off
 * the bottom edge of the glass passes through that zone on the way out, so
 * "leave the panel" cancels too without needing a rule of its own.
 *
 * DROPOUTS. The controller drops contact about 34 times a second while a
 * finger is down, so a gesture that ENDS on release cannot believe
 * f->touchDown going false - see apps/four.c's header section 2 for the
 * arithmetic behind the two numbers below, which are its numbers: a release
 * verdict needs MENU_RELEASE_GRACE_MS of continuous silence, and a gesture
 * arms only on contact sustained at a rate no stray burst can fake.
 *
 * The state machine below is four.c's, second copy. Deliberate duplication,
 * not an oversight: it is thirty lines, the two apps do different things at
 * the end of it (four.c drops a piece and hands the puck over, this one
 * switches app), and sharing it would mean a new runtime-level header for
 * two callers. If a third app needs it, extract it then. The arithmetic that
 * justifies the constants lives in exactly one place either way, which is
 * the part that would actually rot.
 * ------------------------------------------------------------------- */
#define MENU_LAUNCH_BAND_H    220
#define MENU_RELEASE_GRACE_MS 300
#define MENU_ARM_SAMPLES        4
#define MENU_ARM_MS            40
#define MENU_ARM_RATE_HZ       15u

// The halo: a soft grey disc behind the icon under the thumb. Round, so it
// needs no corner treatment at all (decision 0009), and one shapes.h call.
// Big enough to read as "this one" past a thumb, light enough that the black
// icon still sits clearly on top of it.
//
// CAPPED TO THE COLUMN IT LIVES IN, and that cap is load-bearing rather than
// tidy. Every push here is one column's strip, and shapes.h's primitives
// take no clip - so a halo wider than its own column paints into the
// neighbour, outside the rectangle that gets pushed, and stays there. That
// is decision 0001's second invariant broken and a grey crescent left
// stranded beside the icon you just left. It showed up as 250 outside-push
// violations the first time this ran, from 2px of overflow each side at four
// apps (112px columns, radius 58). The cap also means the halo shrinks
// correctly as apps are added rather than silently starting to bleed at five.
#define MENU_HALO_R_MAX 58.0f
#define MENU_HALO_GAP    3.0f

static uint16_t menu_halo_color(void) {
    return px_swap(0xDEFB); // #DEDEDE
}

/* ---------------------------------------------------------------------
 * Painting. One column at a time, and every push is a FULL-HEIGHT LANDSCAPE
 * STRIP - gfx maps a landscape rectangle to the panel with width and height
 * swapped, so the pushed row length is the landscape HEIGHT, which is
 * LAND_H = 368 and a multiple of 8 on every push, at rest and mid-gesture
 * alike (decision 0001). The same discipline apps/four.c uses, for the same
 * reason: there is no per-frame bounding-box arithmetic left to get wrong.
 *
 * A strip is redrawn from white every time rather than patched, so a halo
 * that has moved away cannot leave anything behind.
 * ------------------------------------------------------------------- */
static void render_column(int i, bool hovered) {
    int bx, bw;
    column_rect_land(i, &bx, &bw);
    gfx_fill_rect_land(bx, 0, bw, LAND_H, PX_WHITE);
    int iconX = bx + (bw - ICON_W) / 2;
    int iconY = ICON_TOP_MARGIN;
    if (hovered) {
        float r = (float)bw / 2.0f - MENU_HALO_GAP;
        if (r > MENU_HALO_R_MAX) r = MENU_HALO_R_MAX;
        shapes_fill_disc_aa_land((float)(bx + bw / 2), (float)(iconY + ICON_H / 2),
                                  r, menu_halo_color());
    }
    draw_icon_for(g_apps[i], iconX, iconY, PX_BLACK);
}

static void push_column(int i) {
    int bx, bw;
    column_rect_land(i, &bx, &bw);
    gfx_push_land(bx, 0, bw, LAND_H);
}

static void menu_paint_all(void) {
    for (int i = 0; i < g_appCount; i++) render_column(i, false);
}

/* ---------------------------------------------------------------------
 * State and the app_t callbacks.
 * ------------------------------------------------------------------- */
typedef struct {
    bool     contactSeen;      // a gesture is in progress (dropouts included)
    bool     armed;            // it has survived ARM_SAMPLES/ARM_MS at rate
    uint32_t gestureStartMs;
    uint32_t lastContactMs;    // last sample that actually reported contact
    int      contactCount;
    int      hoverCol;         // the lit column, or -1 for none/cancel
} menu_state_t;

static menu_state_t *s_menu;

// Called by the runtime (see menu.h) before it switches into the menu, so it
// can tell menu_enter() which app to default a selection cursor to. That
// cursor is gone, so this file has nothing left to do with the value - but
// the function stays and keeps accepting it: runtime_core.c calls it
// unconditionally on every chord that opens the menu, and this file is not
// the one that gets to change that contract.
void menu_set_return_app(int index) {
    (void)index;
}

static void menu_enter(void) {
    s_menu = APP_STATE(menu_state_t);
    s_menu->hoverCol = -1;
    menu_paint_all();
}

// Which column a touch is over, or -1 when it is in the cancel band below
// the icons. Only x decides which column (the target is the full-height
// column - see column_hit_test); y decides only whether it counts at all.
static int menu_hit(int lx, int ly) {
    if (ly >= MENU_LAUNCH_BAND_H) return -1;
    return column_hit_test(lx);
}

static void menu_set_hover(int col) {
    if (col == s_menu->hoverCol) return;
    int old = s_menu->hoverCol;
    s_menu->hoverCol = col;
    if (old >= 0) { render_column(old, false); push_column(old); }
    if (col >= 0) { render_column(col, true); push_column(col); }
}

static void menu_tick(const app_frame_t *f) {
    menu_state_t *s = s_menu;

    if (f->touchDown) {
        if (!s->contactSeen) {
            s->contactSeen = true;
            s->gestureStartMs = f->nowMs;
            s->contactCount = 0;
        }
        s->lastContactMs = f->nowMs;
        s->contactCount++;

        uint32_t elapsed = f->nowMs - s->gestureStartMs;
        if (!s->armed && s->contactCount >= MENU_ARM_SAMPLES && elapsed >= MENU_ARM_MS &&
            (uint32_t)s->contactCount * 1000u >= MENU_ARM_RATE_HZ * elapsed) {
            s->armed = true;
        }
        if (s->armed) {
            int lx, ly;
            panel_to_land(f->touchX, f->touchY, &lx, &ly);
            menu_set_hover(menu_hit(lx, ly));
        }
        return;
    }

    // No contact this tick. That is almost always a dropout, not a lift, so
    // nothing happens until the silence has lasted long enough to believe.
    if (!s->contactSeen) return;
    if ((f->nowMs - s->lastContactMs) < MENU_RELEASE_GRACE_MS) return;

    bool wasArmed = s->armed;
    int col = s->hoverCol;
    s->contactSeen = false;
    s->armed = false;
    s->contactCount = 0;
    menu_set_hover(-1);   // unlight first, so a cancel leaves the menu
                           // exactly as it was found

    if (!wasArmed || col < 0) {
        // Cancelled: released in the dead band below the icons, dragged off
        // the glass, or never armed at all (a stray). The menu stays open,
        // which is the whole point of being able to change your mind.
        if (wasArmed) printf("menu: cancelled\r\n");
        return;
    }
    printf("menu: launch %d\r\n", col);
    app_switch_to(col);
}

const app_t g_menuApp = {
    .name       = "MENU",
    .enter      = menu_enter,
    .tick       = menu_tick,
    .leave      = NULL,
    .landscape  = true,
    .wantsShake = false,
};
